CSI API ETABS v1
cPropAreaSpring Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPropAreaSpring
Public Interface cPropAreaSpring
Dim instance As cPropAreaSpring
public interface class cPropAreaSpring
type cPropAreaSpring =  interface end
The cPropAreaSpring type exposes the following members.
Methods
Name | Description
ChangeName
 Changes the name of a defined area spring property
Delete
 Deletes the specified area spring property
GetAreaSpringProp
 Retrieves an existing named area spring property
GetNameList
 Retrieves the names of all defined area spring property
SetAreaSpringProp
 Creates a new named area spring property, or modifies an existing named area spring property
Top
See Also
Reference
ETABSv1 Namespace